ChibiOS/ChibiOS/os/hal/ports/STM32/STM32L4xx+/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(STM32L4xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4xx_MCUCONF not defined"
#endif

#if defined(STM32L4R5xx) && !defined(STM32L4R5_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4R5_MCUCONF not defined"

#elif defined(STM32L4S5xx) && !defined(STM32L4S5_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4S5_MCUCONF not defined"

#elif defined(STM32L4R7xx) && !defined(STM32L4R7_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4R7_MCUCONF not defined"

#elif defined(STM32L4S7xx) && !defined(STM32L4S7_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4S7_MCUCONF not defined"

#elif defined(STM32L4R9xx) && !defined(STM32L4R9_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4R9_MCUCONF not defined"

#elif defined(STM32L4S9xx) && !defined(STM32L4S9_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32L4S9_MCUCONF not defined"

#endif

/**
 * @name    System Limits for VOS range 1
 * @{
 */
#define STM32_VOS1_SYSCLK_MAX               120000000
#define STM32_VOS1_SYSCLK_MAX_NOBOOST       80000000
#define STM32_VOS1_HSECLK_MAX               48000000
#define STM32_VOS1_HSECLK_BYP_MAX           48000000
#define STM32_VOS1_HSECLK_MIN               8000000
#define STM32_VOS1_HSECLK_BYP_MIN           8000000
#define STM32_VOS1_LSECLK_MAX               32768
#define STM32_VOS1_LSECLK_BYP_MAX           1000000
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_BYP_MIN           32768
#define STM32_VOS1_PLLIN_MAX                16000000
#define STM32_VOS1_PLLIN_MIN                2660000
#define STM32_VOS1_PLLVCO_MAX               344000000
#define STM32_VOS1_PLLVCO_MIN               64000000
#define STM32_VOS1_PLLP_MAX                 120000000
#define STM32_VOS1_PLLP_MIN                 2064500
#define STM32_VOS1_PLLQ_MAX                 120000000
#define STM32_VOS1_PLLQ_MIN                 8000000
#define STM32_VOS1_PLLR_MAX                 120000000
#define STM32_VOS1_PLLR_MIN                 8000000
#define STM32_VOS1_PCLK1_MAX                120000000
#define STM32_VOS1_PCLK2_MAX                120000000
#define STM32_VOS1_ADCCLK_MAX               80000000

#define STM32_VOS1_0WS_THRESHOLD            20000000
#define STM32_VOS1_1WS_THRESHOLD            40000000
#define STM32_VOS1_2WS_THRESHOLD            60000000
#define STM32_VOS1_3WS_THRESHOLD            80000000
#define STM32_VOS1_4WS_THRESHOLD            100000000
#define STM32_VOS1_5WS_THRESHOLD            120000000
/** @} */

/**
 * @name    System Limits for VOS range 2
 * @{
 */
#define STM32_VOS2_SYSCLK_MAX               0
#define STM32_VOS2_SYSCLK_MAX_NOBOOST       26000000
#define STM32_VOS2_HSECLK_MAX               26000000
#define STM32_VOS2_HSECLK_BYP_MAX           26000000
#define STM32_VOS2_HSECLK_MIN               8000000
#define STM32_VOS2_HSECLK_BYP_MIN           8000000
#define STM32_VOS2_LSECLK_MAX               32768
#define STM32_VOS2_LSECLK_BYP_MAX           1000000
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_BYP_MIN           32768
#define STM32_VOS2_PLLIN_MAX                16000000
#define STM32_VOS2_PLLIN_MIN                2660000
#define STM32_VOS2_PLLVCO_MAX               128000000
#define STM32_VOS2_PLLVCO_MIN               64000000
#define STM32_VOS2_PLLP_MAX                 26000000
#define STM32_VOS2_PLLP_MIN                 2064500
#define STM32_VOS2_PLLQ_MAX                 26000000
#define STM32_VOS2_PLLQ_MIN                 8000000
#define STM32_VOS2_PLLR_MAX                 26000000
#define STM32_VOS2_PLLR_MIN                 8000000
#define STM32_VOS2_PCLK1_MAX                26000000
#define STM32_VOS2_PCLK2_MAX                26000000
#define STM32_VOS2_ADCCLK_MAX               26000000

#define STM32_VOS2_0WS_THRESHOLD            8000000
#define STM32_VOS2_1WS_THRESHOLD            16000000
#define STM32_VOS2_2WS_THRESHOLD            26000000
#define STM32_VOS2_3WS_THRESHOLD            0
#define STM32_VOS2_4WS_THRESHOLD            0
#define STM32_VOS2_5WS_THRESHOLD            0
/** @} */

/* Voltage related limits.*/
#if (STM32_VOS == STM32_VOS_RANGE1) || defined(__DOXYGEN__)
#define STM32_SYSCLK_MAX                    STM32_VOS1_SYSCLK_MAX
#define STM32_SYSCLK_MAX_NOBOOST            STM32_VOS1_SYSCLK_MAX_NOBOOST
#define STM32_HSECLK_MAX                    STM32_VOS1_HSECLK_MAX
#define STM32_HSECLK_BYP_MAX                STM32_VOS1_HSECLK_BYP_MAX
#define STM32_HSECLK_MIN                    STM32_VOS1_HSECLK_MIN
#define STM32_HSECLK_BYP_MIN                STM32_VOS1_HSECLK_BYP_MIN
#define STM32_LSECLK_MAX                    STM32_VOS1_LSECLK_MAX
#define STM32_LSECLK_BYP_MAX                STM32_VOS1_LSECLK_BYP_MAX
#define STM32_LSECLK_MIN                    STM32_VOS1_LSECLK_MIN
#define STM32_LSECLK_BYP_MIN                STM32_VOS1_LSECLK_BYP_MIN
#define STM32_PLLIN_MAX                     STM32_VOS1_PLLIN_MAX
#define STM32_PLLIN_MIN                     STM32_VOS1_PLLIN_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS1_PLLVCO_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS1_PLLVCO_MIN
#define STM32_PLLP_MAX                      STM32_VOS1_PLLP_MAX
#define STM32_PLLP_MIN                      STM32_VOS1_PLLP_MIN
#define STM32_PLLQ_MAX                      STM32_VOS1_PLLQ_MAX
#define STM32_PLLQ_MIN                      STM32_VOS1_PLLQ_MIN
#define STM32_PLLR_MAX                      STM32_VOS1_PLLR_MAX
#define STM32_PLLR_MIN                      STM32_VOS1_PLLR_MIN
#define STM32_PCLK1_MAX                     STM32_VOS1_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS1_PCLK2_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS1_ADCCLK_MAX

#define STM32_0WS_THRESHOLD                 STM32_VOS1_0WS_THRESHOLD
#define STM32_1WS_THRESHOLD                 STM32_VOS1_1WS_THRESHOLD
#define STM32_2WS_THRESHOLD                 STM32_VOS1_2WS_THRESHOLD
#define STM32_3WS_THRESHOLD                 STM32_VOS1_3WS_THRESHOLD
#define STM32_4WS_THRESHOLD                 STM32_VOS1_4WS_THRESHOLD
#define STM32_5WS_THRESHOLD                 STM32_VOS1_5WS_THRESHOLD

